[
{"Review:": "Handler for 'HelloFresh' - same principle: no service, no employees, just automated emails and letters. It's basically an algorithm and not a company."},
{"Review:": "Even though all the bills have long since been settled, Pair Finance has been harassing me with threats for weeks. Reference Number 137380395038 you will do nothing but keep going on threatening people, because the way you earn money"},
{"Review:": "Keine Kommunikation mit "},
{"Review:": "Basically, they are a scamming company and they do it by pretending to be legitimate. If you have a problem with your payment, they keep your subscription and after some months later they send you a confusing email and you don't even realize that there is a problem with your payment, then they charge you a very unfair amount. Now they are charging me about 13 times the amount I should have paid."},
{"Review:": "had no problems whatsoever on setting rates, didn't have the money for 1 month, wrote them I handle it next month and did. had no problems with PAIR"},
{"Review:": "Raised a complaint to European Commission against Pair Finance and Gigmit, being a victim of data and personal info theft, wrote several emails to this so called company which they have ignored. I will talk with a good team of solicitors in regards to this and write again to European Commission as they helped me with Gigmit but these ticks just stay and try to suck the blood out of you, ignoring emails and every form of contact. I cannot be bothered but take me to court, lawyers are everywhere, we might just make a show out of this. God bless"},
{"Review:": "I signed up to gigmit one time, and after few years I started to get e-mails from PAIR Finance, that I owe gigmit over 500euros. After looking it back, when I signed up I was randomly put on premium-pro and they started to charge me 22eur per month. Now I asked documents about contract, where I signed contract, that I wanted that service. I got back e-mail, which was in German, I only got documents, that I signed up to their site and invoices. Full of scam, never ever used gigmit and their serivce, and now they are trying to take legal actions against me."},
{"Review:": "I don’t know who this company is but I’ve received a WhatsApp message and a letter saying I owe Gigmit €45. Confusing, as this service was cancelled within the 14 day cooling off period in the summer/autumn of 22! "},
{"Review:": "Pair finance have colluded with Jimdo to create fake debt. Customers close accounts with Jimdo who then, two years later, claim that their accounts had auto renewal agreements in place. They then hand it over to pair who chase and threaten the customers hoping to frighten them into paying up. Corrupt and immoral. Paid and Jimdo should be ashamed."},
{"Review:": "These are a bunch of low-level extortionists as far as I can see. They appear to have inherited companies' old accounts and scour them for irregularities. Then they hassle people with such threatening language for money that I am quite sure a lot of people just pay them the £40 or whatever to make them go away. "},
{"Review:": "I am disappointed with this company. Even though I had never heard of them before, I received a letter demanding that I pay 30€ for a cancelled service. I tried to contact them via email and phone, but it took them a whole week to reply. And when they did, they increased the costs to 50€! I feel like I wasted my time trying to get help from them, and no one was there to assist me especially Tina Hausmann."},
{"Review:": "Absolute thieves! "},
{"Review:": "At our University we had an invoice from Jimdo which was definitely not justified, PAIR finance then just added more than 50% and started to threaten. They never reacted to the actual content our mails or offers, instead writing obnoxious e-mails about things we had never said or done (e.g., that we had recognized the dept - which was simply wrong). People pick up the phone, but then hang it up at their convenience. And when we decided to pay this invoice with our credit card, just to have some piece of mind before christmas and forget about this obnoxious issue once and for all, their payment link did not work and there was (again) no reaction to our e-mail, as precisely this. So, really bad. And together with the Jimdo business practice of asking money for a Web hosting which was never done, not much more than an organized scam...."},
{"Review:": "They don't know that we also speak french in Switzerland. Great speaking in mix of German and English for the support."},
{"Review:": "They do not reply to emails and do not provide sufficient proof of ownership of the debt. If you are a company thinking of using Pair Finance they will not represent you well. Dealing with them feels like you are dealing with amateurs."},
{"Review:": "This company never replies to emails and is chasing and issueing threatening letters for 30€ for an item I paid for in full on a credit card to TennisPoint."},
{"Review:": "It's a scam please dont trust them and dont pay anything really they have no legal right to spam your inbox."},
{"Review:": "I am repeatedly getting invoices that i owe them money for a service i cancelled way before they where alloud to reinstate the payment when trying to contact pair finance the only language they speak is german and all their letters and emails are in german i am very upset with pair finance for not seeking contact in english or dutch"}
]